Repository: Aakash10-Coder/GNUSim8085
Catalog: po/*.po
Languages: hi

source: Select font
hi: फोंट्स चुने

source: Program has errors. Check the Message pane.
hi: प्रोग्राम में एक या ज्यादा त्रुटिया है. जानकारी के लिए मेसेज विंडो देखे.

source: Error executing program
hi: क्रियान्वित करने में त्रुटि

source: Error in step in
hi: स्टेप इन में त्रुटि

source: Error in step over
hi: स्टेप ओवर में त्रुटि

source: Error in step out
hi: स्टेप आउट में त्रुटि

source: Enter a valid number within range
hi: सीमा के भीतर एक मान्य संख्या दर्ज करें

source: Enter a valid number within range (0-65535 or 0h-FFFFh)
hi: सीमा के भीतर एक मान्य संख्या दर्ज करें (0-65535 or 0h-FFFFh)

source: Enter a valid number within range (0-255 / 0h-00FFh)
hi: सीमा के भीतर एक मान्य संख्या दर्ज करें (0-255 / 0h-00FFh)

source: The tutorial file, asm-guide.txt, was not found. It should be present in directory -
hi: टुटोरिअल फाइल asm-guide.txt नहीं मिली।यह निर्देशिका में मौजूद होना चाहिए |

source: _Assembler
hi: _असेम्बलर

source: _Breakpoints
hi: _ब्रेक पॉइंट्स

source: New source file
hi: नया स्रोत फ़ाइल

source: Open a file
hi: फाइल खोले

source: Save file
hi: फाइल को सुरक्षित करे

source: Save file as
hi: फाइल को फिरसे सुरक्षित करे

source: Print program
hi: प्रोग्राम प्रिंट करे

source: _Registers
hi: _रजिस्टर्स

source: Reset Registers
hi: Registers रिसेट करे

source: _Flags
hi: _फ्लैग्स

source: Reset Flags
hi: _Flags रिसेट करे

source: _IO Ports
hi: _IO पोर्ट्स

source: Reset IO Ports
hi: IO Ports रिसेट करे

source: _Memory
hi: _मेमोरी

source: Reset Memory
hi: Memory रिसेट करे

source: Reset _All
hi: सब कुछ रिसेट करे

source: Reset All
hi: सब कुछ रिसेट करे

source: A_ssemble
hi: असेम्बल

source: Only assemble program
hi: सिर्फ प्रोग्राम असेम्बल करे

source: Execute assembled and loaded program
hi: असेम्बल और लोड किये गए प्रोग्राम को कार्यान्वित करे

source: Show _listing
hi: _listing दिखाए

source: Show the source code along with opcodes and operands in hex numbers
hi: Source code को Opcdoe, operand और Hex नंबर के साथ दिखाए

source: Step _in
hi: स्टेप इन

source: Step in the code
hi: कोड में स्टेप इन करे

source: Step o_ver
hi: स्टेप ओवर

source: Step over the code without calling functions
hi: फंक्शनको बुलाये बिना कोड में स्टेप ओवर करे

source: Step _out
hi: स्टेप आउट

source: Step out of the current function
hi: मौजूदा फंक्शनमें से स्टेप आउट करे

source: Toggle _breakpoint
hi: ब्रेक पॉइंट को टॉगल करे

source: Toggles breakpoint at current line
hi: मौजूदा लाइन में ब्रेक पॉइंट को टॉगल करे

source: _Clear all breakpoints
hi: सभी ब्रेकपॉइंट को मिटाये

source: Remove all breakpoints
hi: सभी ब्रेकपॉइंट को मिटाये

source: Stop execution
hi: कार्यान्वयन बंध करे

source: Stop debugging
hi: डिबगिंग बंध करे

source: _Contents
hi: कंटेंट्स

source: Assembler _Tutorial
hi: असेम्ब्लर ट्यूटोरियल

source: Show/Hide side pane
hi: साइड पेन दिखाए/छुपाये

source: GNUSim8085 - 8085 Microprocessor Simulator
hi: GNUSim8085 - 8085 माइक्रोप्रोसेसर सिम्युलेटर

source: Registers
hi: रजिस्टर्स

source: Flag
hi: फ्लैग

source: Decimal
hi: डेसीमल

source: Enter a decimal number
hi: डेसीमल नंबर डालें

source: To Hex
hi: हेक्स में

source: Convert this number to hexadecimal
hi: नंबर को हेक्स में परिवर्तित करे

source: Hex
hi: हेक्स

source: Enter a hexadecimal number
hi: हेक्साडेसिमल नंबर डालें

source: To Dec
hi: डेसीमल में

source: Convert this number to decimal
hi: नंबर को डेसीमल में परिवर्तित करे

source: Decimal - Hex Conversion
hi: डेसिमल- हेक्स परिवर्तन

source: Change the port address to view here
hi: यहाँ देखने के लिए पोर्ट एड्रेस बदले

source: Enter new port value and click Update
hi: नयी पोर्ट वैल्यू डाले और अपडेट पर क्लीक करे

source: Update Port Value
hi: अपडेट पोर्ट वैल्यू

source: Update the port value
hi: अपडेट पोर्ट वैल्यू

source: I/O Ports
hi: I/O पोर्ट्स

source: Change the memory location to view here
hi: यहाँ देखने के लिए मेमोरी एड्रेस बदले

source: Edit new value and click Update
hi: नयी वैल्यू बदले और अपडेट पर क्लीक करे

source: Update Memory
hi: मेमोरी अपडेट करे

source: Update the current memory location
hi: मौजूदा मेमोरी लोकेशन अपडेट करे

source: Memory
hi: मेमोरी

source: Load me at
hi: यहाँ लोड करे

source: Enter the program address. End with a 'h' if it is a hex address.
hi: प्रोग्राम अड्रेस यहाँ डाले. हेक्स अड्रेस के लिए अंत में 'h' लगाए.

source: Data
hi: डाटा

source: Stack
hi: स्टेक

source: KeyPad
hi: कीपेड़

source: Start
hi: स्टार्ट

source: translator_credits
hi: ट्रांसलेटर क्रेडिट्स

source: Assembler Listing
hi: असेम्ब्लर लिस्टिंग

source: Save to file
hi: फाइल में सुरक्षित करे

source: Assembler Tutorial
hi: असेम्ब्लर टुटोरिअल

source: GNUSim8085 start with dialog
hi: GNUSim8085 : डायलॉग के साथ शुरू करे

source: 1. How to use this simulator?
hi: 1. इस सिम्युलेटर का उपयोग कैसे करे?

source: _Tutorial
hi: टुटोरिअल

source: A short tutorial on writing assembly code!
hi: असेम्ब्ली प्रोग्राम लिखने के लिए संक्षिप्तमें जानकारी!

source: 2. Open an existing assembly program.
hi: 2. मौजूदा असेम्ब्ली प्रोग्राम खोलने के लिए.

source: _Open program
hi: प्रोग्राम खोले

source: Open an already saved program
hi: सुरक्षित किया हुआ प्रोग्राम खोले

source: What do you want to do now?
hi: आगे आप क्या करना चाहते है?

source: Don't forget to read the documentation given in "doc" directory.
hi: "doc" फोल्डर में दिया गया डॉक्युमेंटेशन फ़ाइल पढ़ना ना भूले.

source: Choose a symbol
hi: संकेत चुने

source: Enter a symbol or choose one from the lists
hi: संकेत डाले या सूचि में से चुने

source: Enter Symbol
hi: संकेत डाले

source: Variables List
hi: वेरिएबल्स की सूचि

source: Functions List
hi: फंक्शन्स की सूचि

source: Macros List
hi: मेक्रोस की सूचि

source: Choose a register
hi: रजिस्टर को चुने

source: Simulator: Idle
hi: सिमलुलेटर: स्थगित

source: Unwanted %c reached
hi: अवांछित %c1 पर पहुंचा

source: Invalid Opcode
hi: अमान्य ओपकोड

source: Instruction 'RIM' Not implemented
hi: RIM इंस्ट्रक्शन अभी अमली नहीं है

source: Instruction 'SIM' Not implemented
hi: SIM इंस्ट्रक्शन अभी अमली नहीं है

source: Assembling Aborted
hi: असेम्ब्लिंग बंद किया गया है

source: Label should be given to a code line
hi: लेबल सिर्फ कोड लाइन के आगे ही लिखा जाता है

source: Incomplete opcode
hi: अपूर्ण ओपकोड

source: Neither Op not PsOp: [%s]
hi: Op या PsOp नहीं [%s]

source: Invalid Opcode or Pseudo op
hi: अपूर्ण ओपकोड या Pseudo op

source: Opcode needs an user argument
hi: ओपकोडको यूजरसे आर्गुमेंट चाहिए

source: Extra characters in line
hi: लाइन में अतिरिक्त करैक्टर है

source: Expression error in symbol
hi: अभिव्यक्ति में संकेत की गलती

source: Undefined symbol
hi: अपरिभाषित संकेत

source: Redundant label
hi: अनावश्यक लेबल

source: Invalid Operand in EQU
hi: EQU में गलत ओपरांड

source: Invalid operand
hi: गलत ओपरांड

source: Redefinition of symbol
hi: संकेत की पुनः परिभाषा

source: Invalid data size
hi: डाटा साइज अमान्य

source: DS: Exceeded limit
hi: DS: अधिकतम सीमा से बहार

source: DB: Operand error
hi: DB : गलत ओपरांड

source: Invalid operand or symbol. Check whether operands start with a number. e.g a0H should be 0a0H
hi: अमान्य ओपरांड या संकेत. ध्यान रखे के ऑपरेंड नंबर्स सिर्फ नंबर से शुरू हो सकते है. जैसे की a0h की जगह 0a0H लिखे

source: Program assembled successfully
hi: प्रोग्राम सफलतापूर्वक असेम्ब्ल हुआ

source: Simulator: Program running
hi: सिम्युलेटर: प्रोग्राम रनिंग

source: Execution branched to invalid memory location <%xH>. Execution will be stopped! Check whether you've included the "hlt" instruction at the end of your program and your source program is not empty. Also check your program logic. If you're very sure, there might be a bug in GNUSim8085.If so you're advised to send a copy of your source program.
hi: प्रोग्रामका एक्सेक्यूशन अमान्य मेमोरी लोकेशनपे पहुँच गया है <%xH>. एक्सेक्यूशन रोक दिया गया है. जाँच करे की प्रोग्राम के अंत में आपने 0"hlt" इंस्ट्रक्शन लिखा है और यह भी जांचे की आपका प्रोग्राम पूरा रिक्त नहीं है. और प्रोग्राम के लॉजिक के सही होने का भी जाँच करे. और आप आपके प्रोग्राम के सही होने पे निश्चित है तो GNU8085 सॉफ्टवेयर में भी गलती हो सकती है. कृपया आपका प्रोग्राम हमको भेजे.

source: Assembler: running
hi: असेम्बलर : रनिंग

source: Line No
hi: लाइन क्रमांक

source: Assembler Message
hi: असेम्ब्लर सन्देश

source: Address
hi: एड्रेस

source: Variable
hi: वेरिएबल

source: Value
hi: मूल्य

source: ; Assembler generated listing; Not editable.
hi: असेम्बलरका जनरेट किया गया लिस्टिंग : असंपादित

source: ; Generated by GNUSim8085: %s
hi: ; GNUSim8085 द्वारा जनरेट किया गया : %s

source: ;Assembler Listing (Do Not assemble)
hi: ;असेम्बलर लिस्टिंग (संपादन ना करे)

source: Failed to open <%s>
hi: खोलने में असफल <%s>

source: File already exists; overwrite it?
hi: फाइल पहले से ही मौजूद है । क्या दोबारा फाइल लिखा जाए?

source: Failed to save <%s>
hi: फाइल सुरक्षित करने में असफल <%s>

source: Failed to save listing file
hi: लिस्टिंग फाइल सुरक्षित करने में असफल

source: Stack Loc
hi: स्टेक लोकेशन

source: Stack size exceeded. Stop the execution
hi: स्टेक की क्षमता के बहार : एक्सेक्यूशन रोक दे

source: More number of POP are executed than PUSH. Stop the execution and check the logic of your program
hi: PUSH की संख्या से ज्यादा POP एक्सेक्यूट किये गए है. एक्सेक्यूशन रोक दे और अपने प्रोग्राम लॉजिक की जाँच करे
